import random

word_list = [
    "яблоко",
    "папа",
    "собака",
    "кошка",
    "река",
    "гора",
    "дерево",
    "молоко",
    "солнце",
    "дождь",
    "машина",
    "птица",
    "свобода",
    "дружба",
    "книга",
    "вода",
    "небо",
    "любовь",
    "день",
    "ночь",
    "жизнь",
    "свет",
    "луна",
    "планета",
    "город",
    "деревня",
    "стол",
    "стул",
    "окно",
    "дверь",
    "компьютер",
    "интернет",
    "смартфон",
    "телефон",
    "часы",
    "письмо",
    "фильм",
    "музыка",
    "картинка",
    "друзья",
    "сказка",
    "путешествие",
    "замок",
    "химия",
    "физика",
    "математика",
    "искусство",
    "поэзия",
    "живопись",
    "ресторан",
    "пицца",
    "суп",
    "хлеб",
    "молоко",
    "сыр",
    "мясо",
    "овощи",
    "фрукты",
    "гитара",
    "пианино",
    "фортепиано",
    "оркестр",
    "соло",
    "песня",
    "танец",
    "художник",
    "актер",
    "режиссер",
    "студия",
    "театр",
    "кинематограф",
    "комедия",
    "драма",
    "фантастика",
    "космос",
    "вселенная",
    "звезда",
    "планетарий",
    "астрономия",
    "галактика",
    "астронавт",
    "космонавт",
    "спутник",
    "ракета",
    "самолет",
    "поезд",
    "автобус",
    "велосипед",
    "пешком",
    "плавание",
    "лыжи",
    "сноуборд",
    "футбол",
    "баскетбол",
    "волейбол",
    "теннис",
    "шахматы",
    "пинг-понг",
    "плавник",
    "плавник",
    "скейтборд",
    "флешка",
    "облако",
]


def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
        """
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / \\
                   -
                """,
        # голова, торс, обе руки, одна нога
        """
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / 
                   -
                """,
        # голова, торс, обе руки
        """
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |      
                   -
                """,
        # голова, торс и одна рука
        """
                   --------
                   |      |
                   |      O
                   |     \\|
                   |      |
                   |     
                   -
                """,
        # голова и торс
        """
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |     
                   -
                """,
        # голова
        """
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   -
                """,
        # начальное состояние
        """
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   -
                """,
    ]
    return print(stages[tries])


def get_word():
    w = random.choice(word_list)
    return w.lower()


def play(word):
    print("Давайте играть в угадайку слов!")
    print("Введи слово или букву, которая может быть в слове!")
    tries = 6
    display_hangman(tries)
    word_completion = "_" * len(word)
    guessed_letters = []
    guessed_words = []
    while tries != 0:
        a = input()
        while not (a.isalpha()):
            print("Введите коректное слово или букву")
            a = input()

        if a in guessed_letters or a in guessed_words:
            print("Вы уже вводили данный символ или слово")
        elif len(a) == 1 and a not in word:
            print("Вы не угадали слово")
            tries -= 1
            display_hangman(tries)
        elif a in word and a != word:
            print("Вы отгадали букву!")
            word = list(word)
            word_completion = list(word_completion)
            for i in range(len(word)):
                if word[i] == a:
                    word_completion[i] = a
            word = "".join(word)
            word_completion = "".join(word_completion)
            print(f"Слово с учетом угаданых букв - {word_completion}")
        elif len(a) > 1 and a != word:
            print("Вы не угадали слово")
            tries -= 1
            display_hangman(tries)
        if len(a) > 1 and a == word:
            print("Вы угадали слово")
            break
        if word_completion == word:
            print("Вы угадали слово")
            break
        if len(a) > 1:
            guessed_words.append(a)
        elif len(a) == 1:
            guessed_letters.append(a)
    else:
        print(f"Угадываемое слово было - {word}")


play(get_word())

like_continue = input("Хочешь сыграть еще раз ? да/нет")
if like_continue == "да":
    get_word()
    play(get_word())
